In [4]:
#Part 1
#Samsung Customer Expierence
# Hypothesis 1 : Average customer satisfaction score is minimum 75%.
# Hypothesis 2 : Overall average satisfaction score of Samsung is same as Apple.
# Sample: 100 Samsung customers and 100 Apple

In [5]:
## Hypothesis 1
# H0 : u >= 75%
# H1a : u <75%
# CI: 95%
# p value: 0.05

In [6]:
ss_Samsung=100
ss_Apple=100

In [235]:
##No data available!

## Health Data

In [12]:
import pandas as pd
import scipy.stats as stats
from statsmodels.stats.weightstats import ztest

health_data=pd.read_csv("dietstudy.csv")

health_data

    patid  age  gender  tg0  tg1  tg2  tg3  tg4  wgt0  wgt1  wgt2  wgt3  wgt4
0       1   45    Male  180  148  106  113  100   198   196   193   188   192
1       2   56    Male  139   94  119   75   92   237   233   232   228   225
2       3   50    Male  152  185   86  149  118   233   231   229   228   226
3       4   46  Female  112  145  136  149   82   179   181   177   174   172
4       5   64    Male  156  104  157   79   97   219   217   215   213   214
5       6   49  Female  167  138   88  107  171   169   166   165   162   161
6       7   63    Male  138  132  146  143  132   222   219   215   215   210
7       8   63  Female  160  128  150  118  123   167   167   166   162   161
8       9   52    Male  107  120  129  195  174   199   200   196   196   193
9      10   45    Male  156  103  126  135   92   233   229   229   229   226
10     11   61  Female   94  144  114  114  121   179   181   176   173   173
11     12   49  Female  107   93  156  148  150   158   153   155   155   154
12     13   61  Female  145  107  129   86  159   157   151   150   145   143
13     14   59    Male  186  142  128  122  101   216   213   210   210   206
14     15   52    Male  112  107  103   89  148   257   255   254   252   249
15     16   60  Female  104  103  117   79  130   151   146   144   144   140

In [34]:
print("Avg. TG level Before",round(health_data.tg0.mean(),2))
print("Avg. TG level After",round(health_data.tg4.mean(),2))

Avg. TG level Before 138.44
Avg. TG level After 124.38

In [68]:
# Relational t- test
# Ho : mean TG is same, i.e. u_before-u_after=0 
# Ha : mean TG is decreased, i.e. u_before-u_after >0 
# CI =95%, pvalue: 0.05

# perform the test

s1,p1=stats.ttest_rel(health_data.tg0,health_data.tg4)
print("P value=",p1)

P value= 0.24874946576903698

In [69]:
if p1 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\tThere is decrease in TG levles after the diet") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tThere is no significant difference in TG levles after the diet")

Business Conclusion:
	H0 NOT rejected
	There is no significant difference in TG levles after the diet

In [70]:
print("Avg. Weight Before",round(health_data.wgt0.mean(),2))
print("Avg. Weight After",round(health_data.wgt4.mean(),2))

Avg. Weight Before 198.38
Avg. Weight After 190.31

In [14]:
# Relational t- test
# Ho : mean Weight is same, i.e. u_before-u_after=0 
# Ha : mean weight is decreased, i.e. u_before-u_after >0 
# CI =95%, pvalue: 0.05

# perform the test

s2,p2=stats.ttest_rel(health_data.wgt0,health_data.wgt4)
print("P value=",p2)

P value= 1.137689414996614e-08

In [15]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\tThere is decrease in Weight after the diet") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tThere is no significant difference in Weight after the diet")

Business Conclusion:
	H0 rejected
	There is decrease in Weight after the diet

### Credit card promotion

In [16]:
card_data=pd.read_csv("creditpromo.csv")
card_data

         id         insert      dollars
0       148       Standard  2232.771979
1       572  New Promotion  1403.807542
2       973       Standard  2327.092181
3      1096       Standard  1280.030541
4      1541  New Promotion  1513.563200
..      ...            ...          ...
495  130163  New Promotion  1513.060134
496  130204  New Promotion  1020.757943
497  130255       Standard  1919.856304
498  130583       Standard  1863.014814
499  130682       Standard  1295.012183

[500 rows x 3 columns]

In [17]:
card_data['insert'].unique()

array(['Standard', 'New Promotion'], dtype=object)

In [18]:
card_data.groupby("insert")["dollars"].mean()

insert
New Promotion    1637.499983
Standard         1566.389031
Name: dollars, dtype: float64

In [19]:
standard=card_data.loc[card_data['insert']=="Standard","dollars"]

In [20]:
New_Promotion=card_data.loc[card_data['insert']=="New Promotion","dollars"]

In [21]:
New_Promotion

1      1403.807542
4      1513.563200
5      1729.627996
6      1609.705918
9      1854.489028
          ...
491    2227.464385
492    2007.541756
494    2000.050800
495    1513.060134
496    1020.757943
Name: dollars, Length: 250, dtype: float64

In [22]:
standard

0      2232.771979
2      2327.092181
3      1280.030541
7      1476.624884
8      1460.769753
          ...
490    1336.515307
493    1330.233179
497    1919.856304
498    1863.014814
499    1295.012183
Name: dollars, Length: 250, dtype: float64

In [23]:
print("Average expediture for people with New Promotion: $",round(card_data.groupby("insert")["dollars"].mean()[0],2))

print("Average expediture for people with Standard Promotion: $",round(card_data.groupby("insert")["dollars"].mean()[1],2))

Average expediture for people with New Promotion: $ 1637.5
Average expediture for people with Standard Promotion: $ 1566.39

In [24]:
# Relational t- test
# Ho : mean expenditure is the same, i.e. u_promotion-u_standard=0 
# Ha : mean expendiure has increase=, i.e. u_promotion-u_standard>0
# CI =95%, pvalue: 0.05

# perform the test

s3,p3=stats.ttest_rel(New_Promotion,standard)
print("P value=",p3)

P value= 0.022666277259380106

In [25]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\tNew Promotion is successful") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tThere is no significant difference in expenditure due to New Promotion")

Business Conclusion:
	H0 rejected
	New Promotion is successful

### Hybrid seed production

In [26]:
polli_data=pd.read_csv("pollination.csv")

polli_data

      Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0   Natural      1.85            147.70            16.86
1   Natural      1.86            136.86            16.77
2   Natural      1.83            149.97            16.35
3   Natural      1.89            172.33            18.26
4   Natural      1.80            144.46            17.90
5   Natural      1.88            138.30            16.95
6   Natural      1.89            150.58            18.15
7   Natural      1.79            140.99            18.86
8   Natural      1.85            140.57            18.39
9   Natural      1.84            138.33            18.58
10     Hand      2.58            224.26            18.18
11     Hand      2.74            197.50            18.07
12     Hand      2.58            230.34            19.07
13     Hand      2.62            217.05            19.00
14     Hand      2.68            233.84            18.00
15     Hand      2.56            216.52            18.49
16     Hand      2.34            211.93            17.45
17     Hand      2.67            210.37            18.97
18     Hand      2.45            199.87            19.31
19     Hand      2.44            214.30            19.36

In [27]:
Natural=polli_data.loc[polli_data["Group"]=="Natural"]

In [28]:
Natural

     Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0  Natural      1.85            147.70            16.86
1  Natural      1.86            136.86            16.77
2  Natural      1.83            149.97            16.35
3  Natural      1.89            172.33            18.26
4  Natural      1.80            144.46            17.90
5  Natural      1.88            138.30            16.95
6  Natural      1.89            150.58            18.15
7  Natural      1.79            140.99            18.86
8  Natural      1.85            140.57            18.39
9  Natural      1.84            138.33            18.58

In [29]:
Hand=polli_data.loc[polli_data["Group"]=="Hand"]

In [30]:
Hand

   Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
10  Hand      2.58            224.26            18.18
11  Hand      2.74            197.50            18.07
12  Hand      2.58            230.34            19.07
13  Hand      2.62            217.05            19.00
14  Hand      2.68            233.84            18.00
15  Hand      2.56            216.52            18.49
16  Hand      2.34            211.93            17.45
17  Hand      2.67            210.37            18.97
18  Hand      2.45            199.87            19.31
19  Hand      2.44            214.30            19.36

##### Is the overall population of Seed yield/plant (g) equals to 200?

In [31]:
Y=polli_data.Seed_Yield_Plant

In [32]:
# Single T test
# Ho : mean seed yield is 200, i.e. u_yield=200 
# Ha : mean seed yield not 200=, i.e. u_yield<>200
# CI =95%, pvalue: 0.05

# perform the test

syield,pyield=stats.ttest_1samp(Y,200)
print("P value=",pyield)

P value= 0.032891040921283025

In [33]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\t Yield is not 200") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tYield is 200")

Business Conclusion:
	H0 rejected
	 Yield is not 200

##### Test whether the natural pollination and hand pollination under open field conditions are equally effective or are significantly different.

In [34]:
N_wt=Natural.Fruit_Wt
H_wt=Hand.Fruit_Wt

In [35]:
print("Mean weight of naturally pollinated fruit",N_wt.mean())
print("Mean weight of hand pollinated fruit",round(H_wt.mean(),2))

Mean weight of naturally pollinated fruit 1.848
Mean weight of hand pollinated fruit 2.57

In [36]:
# independent T test
# Ho : mean fruit weights are same, i.e. u_n=u-h 
# Ha : mean weights are differnt=, i.e. u_h>u_n or u_h < u_n
# CI =95%, pvalue: 0.05

# perform the test

s_wt,p_wt=stats.ttest_ind(N_wt,H_wt)
print("P value=",p_wt)

P value= 8.078362076486221e-13

In [37]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\t Mean Weight of both techniques is not same") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tMean Weight of both techniques is same")

Business Conclusion:
	H0 rejected
	 Mean Weight of both techniques is not same

In [38]:
N_yield=Natural.Seed_Yield_Plant
H_yield=Hand.Seed_Yield_Plant

In [39]:
# indipendent T test
# Ho : mean fruit yields for both the techniques are same, i.e. u_n=u-h 
# Ha : mean fruit yields for both the techniques are differnt=, i.e. u_h>u_n or u_h < u_n
# CI =95%, pvalue: 0.05

# perform the test

s_y,p_y=stats.ttest_ind(N_yield,H_yield)
print("P value=",p_y)

P value= 4.2714815854843853e-11

In [40]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\t Mean yields of both techniques is not same") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tMean yields of both techniques is same")

Business Conclusion:
	H0 rejected
	 Mean yields of both techniques is not same

In [41]:
N_len=Natural.Seedling_length
H_len=Hand.Seedling_length

In [42]:
# independent T test
# Ho : mean Seedling_length for both the techniques are same, i.e. u_n=u-h 
# Ha : mean Seedling_length for both the techniques are differnt=, i.e. u_h>u_n or u_h < u_n
# CI =95%, pvalue: 0.05

# perform the test

s_len,p_len=stats.ttest_ind(N_len,H_len)
print("P value=",p_len)

P value= 0.020428817064110226

In [43]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\t Mean seedling_length of both techniques is not same") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tMean seedling_length of both techniques is same")

Business Conclusion:
	H0 rejected
	 Mean seedling_length of both techniques is not same

## DVD player

In [50]:
dvd_data= pd.read_csv('dvdplayer.csv')

In [51]:
dvd_data.agegroup.value_counts()

65 and over    17
Under 25       13
35-44          12
25-34          10
45-54          10
55-64           6
Name: agegroup, dtype: int64

In [52]:
Above_65=dvd_data.loc[dvd_data["agegroup"]=="65 and over","dvdscore"]

Above_55=dvd_data.loc[dvd_data["agegroup"]=="55-64","dvdscore"]

Above_45=dvd_data.loc[dvd_data["agegroup"]=="45-54","dvdscore"]

Above_35=dvd_data.loc[dvd_data["agegroup"]=="35-44","dvdscore"]

Above_25=dvd_data.loc[dvd_data["agegroup"]=="25-34","dvdscore"]

Under_25=dvd_data.loc[dvd_data["agegroup"]=="Under 25","dvdscore"]

In [53]:
# ANOVA F Test
# One way because there is only one continous variable (AgeGroup)

# Ho : mean dvd_score from all the age groups is same, i.e. u_65=u_55=u_35....

# Ha : There is significant difference between the mean score of all the age groups.

# CI =95%, pvalue: 0.05

# perform the test

s_dvd,p_dvd= stats.f_oneway(Above_65,Above_55,Above_45,Above_35,Above_25,Under_25)
print("P value=",p_dvd)

P value= 3.087324905679639e-05

In [54]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\tAverage rating from all the age groups is the same") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tAverage rating from all the age groups is the different")

Business Conclusion:
	H0 rejected
	Average rating from all the age groups is the same

## Customer data

In [55]:
customer_data=pd.read_csv("sample_survey.csv")
customer_data

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese
2,3,Working full time,Married,2.0,36.0,12.0,12.0,12.0,16.0,High school,...,35 to 44,1-2,No,No,No,Yes,Yes,American,American,NaN
3,4,Working full time,Never married,0.0,21.0,13.0,NaN,12.0,NaN,High school,...,Less than 25,None,No,No,No,Yes,Yes,American,Other,NaN
4,5,Working full time,Never married,0.0,35.0,16.0,NaN,12.0,NaN,Bachelor,...,35 to 44,None,No,No,No,No,No,American,American,Korean
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2827,2828,Working full time,Married,2.0,73.0,14.0,8.0,12.0,12.0,Junior college,...,65 or older,1-2,No,No,No,No,No,American,American,German
2828,2829,Working full time,Divorced,0.0,40.0,12.0,12.0,12.0,NaN,High school,...,35 to 44,None,No,No,No,No,No,Japanese,NaN,NaN
2829,2830,Retired,Married,0.0,73.0,6.0,4.0,NaN,10.0,LT High school,...,65 or older,None,Yes,No,Yes,No,No,Korean,American,American
2830,2831,Working full time,Never married,0.0,47.0,12.0,12.0,12.0,NaN,High school,...,45 to 54,None,No,No,No,No,No,Japanese,NaN,NaN
2831,2832,Working part-time,Never married,0.0,20.0,10.0,NaN,NaN,NaN,LT High school,...,Less than 25,None,No,No,No,No,No,Swedish,American,German

In [56]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2832 entries, 0 to 2831
Data columns (total 46 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        2832 non-null   int64
 1   wrkstat   2831 non-null   object
 2   marital   2831 non-null   object
 3   childs    2825 non-null   float64
 4   age       2828 non-null   float64
 5   educ      2820 non-null   float64
 6   paeduc    2041 non-null   float64
 7   maeduc    2399 non-null   float64
 8   speduc    1311 non-null   float64
 9   degree    2822 non-null   object
 10  sex       2832 non-null   object
 11  race      2832 non-null   object
 12  born      2819 non-null   object
 13  parborn   2812 non-null   object
 14  granborn  2630 non-null   float64
 15  income    2503 non-null   object
 16  rincome   1849 non-null   object
 17  polviews  2691 non-null   object
 18  cappun    2599 non-null   object
 19  postlife  2066 non-null   object
 20  happy     2806 non-null   object
 21  hapmar    1337 non-null   object
 22  owngun    1869 non-null   object
 23  news      1870 non-null   object
 24  tvhours   2337 non-null   float64
 25  howpaid   1347 non-null   object
 26  ethnic    2238 non-null   object
 27  eth1      2557 non-null   object
 28  eth2      1102 non-null   object
 29  eth3      444 non-null    object
 30  confinan  1864 non-null   object
 31  conbus    1821 non-null   object
 32  coneduc   1881 non-null   object
 33  conpress  1862 non-null   object
 34  conmedic  1875 non-null   object
 35  contv     1876 non-null   object
 36  agecat    2828 non-null   object
 37  childcat  2825 non-null   object
 38  news1     2832 non-null   object
 39  news2     2832 non-null   object
 40  news3     2832 non-null   object
 41  news4     2832 non-null   object
 42  news5     2832 non-null   object
 43  car1      2832 non-null   object
 44  car2      2266 non-null   object
 45  car3      1672 non-null   object
dtypes: float64(8), int64(1), object(37)
memory usage: 1017.9+ KB

##### Is there any relationship in between labour force status with marital status?

In [57]:
cd_1=customer_data[["wrkstat","marital"]].dropna()

In [58]:
cd_1

                wrkstat        marital
0     Working full time       Divorced
1     Working part-time  Never married
2     Working full time        Married
3     Working full time  Never married
4     Working full time  Never married
...                 ...            ...
2827  Working full time        Married
2828  Working full time       Divorced
2829            Retired        Married
2830  Working full time  Never married
2831  Working part-time  Never married

[2830 rows x 2 columns]

In [59]:
work_marriage=pd.crosstab(cd_1.wrkstat,cd_1.marital)

In [60]:
work_marriage

marital                  Divorced  Married  Never married  Separated  Widowed
wrkstat
Keeping house                  25      200             35         13       55
Other                          12       16             14          4        8
Retired                        53      168             17          6      150
School                          7        9             60          2        1
Temporarily not working         9       23             11          1        2
Unemployed, laid off           10       13             32          0        3
Working full time             295      778            392         58       44
Working part-time              35      138            102          9       20

In [61]:
# Chi Sq contigency test

# Ho : Work status and Maritial status are indipdent

# Ha : Work status and Maritial status are associated

# CI =95%, pvalue: 0.05

# perform the test

stat, p_customer, dof, expected=stats.chi2_contingency(work_marriage)
print("P value",p_customer)

P value 1.4875268409067568e-135

In [62]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\tWork status and Maritial status are associated") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tWork status and Maritial status are indipdent")

Business Conclusion:
	H0 rejected
	Work status and Maritial status are associated

##### Do you think educational qualification is somehow controlling the marital status?

In [63]:
cd_2=customer_data[["educ","marital"]]

In [64]:
cd_2

      educ        marital
0     12.0       Divorced
1     17.0  Never married
2     12.0        Married
3     13.0  Never married
4     16.0  Never married
...    ...            ...
2827  14.0        Married
2828  12.0       Divorced
2829   6.0        Married
2830  12.0  Never married
2831  10.0  Never married

[2832 rows x 2 columns]

In [65]:
edu_marriage=pd.crosstab(cd_2.educ,cd_2.marital)

In [66]:
edu_marriage

marital  Divorced  Married  Never married  Separated  Widowed
educ
0.0             0        1              1          0        0
2.0             0        1              1          0        3
3.0             2        3              2          1        2
4.0             2        2              1          0        4
5.0             2        3              0          0        3
6.0             2       12              2          1        6
7.0             6       11              0          0        4
8.0             9       36              8          2       27
9.0            18       28              9          4       16
10.0           26       48             21          3       15
11.0           25       50             40          6       17
12.0          125      415            180         33       98
13.0           48      118             71         16       17
14.0           62      168             89          9       21
15.0           26       56             48          3       13
16.0           47      214            116         10       25
17.0           13       46             24          2        1
18.0           12       66             24          1        6
19.0            9       21              8          1        2
20.0           10       40             15          1        3

In [67]:
# Chi Sq contigency test

# Ho : Edu status and Maritial status are indipedent

# Ha : Edu status and Maritial status are associated

# CI =95%, pvalue: 0.05

# perform the test

stat2, p_cd2, dof2, expected2=stats.chi2_contingency(work_marriage)
print("P value",p_cd2)

P value 1.4875268409067568e-135

In [68]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\tEdu status and Maritial status are associated") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tEdu status and Maritial status are indipdent")

Business Conclusion:
	H0 rejected
	Edu status and Maritial status are associated

##### Is happiness is driven by earnings or marital status

In [69]:
cd_3=customer_data[["happy","income","marital"]]

In [70]:
cd_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2832 entries, 0 to 2831
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   happy    2806 non-null   object
 1   income   2503 non-null   object
 2   marital  2831 non-null   object
dtypes: object(3)
memory usage: 66.5+ KB

In [71]:
happy_income=pd.crosstab(cd_3.happy,cd_3.income)

In [72]:
happy_income

income,$1000 TO 2999,$10000 - 14999,$15000 - 19999,$20000 - 24999,$25000 or more,$3000 TO 3999,$4000 TO 4999,$5000 TO 5999,$6000 TO 6999,$7000 TO 7999,$8000 TO 9999,LT $1000
happy,,,,,,,,,,,,
Not too happy,7,39,33,40,113,9,9,6,14,12,9,11
Pretty happy,20,107,119,155,888,11,13,18,13,21,30,13
Very happy,5,44,26,50,571,4,10,11,6,14,19,11

In [73]:
# Chi Sq contigency test

# Ho : Happyness and Income status are indipedent

# Ha : Happyness status and Income status are associated

# CI =95%, pvalue: 0.05

# perform the test

stat3, p_cd3, dof3, expected3=stats.chi2_contingency(happy_income)
print("P value",p_cd3)

P value 1.4107677273473057e-26

In [74]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\t Hapiness status and Income status are associated") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tHappyness status and Income status are associated")

Business Conclusion:
	H0 rejected
	 Hapiness status and Income status are associated

In [75]:
happy_marriage=pd.crosstab(cd_3.happy,cd_3.marital)

In [76]:
happy_marriage

marital        Divorced  Married  Never married  Separated  Widowed
happy
Not too happy        72       71            108         30       59
Pretty happy        278      684            426         49      137
Very happy           93      582            120         13       83

In [77]:
# Chi Sq contigency test

# Ho : Happyness and Maritial status are indipedent

# Ha : Happyness status and Maritial status are associated

# CI =95%, pvalue: 0.05

# perform the test

stat4, p_cd4, dof4, expected4=stats.chi2_contingency(happy_marriage)
print("P value",p_cd4)

P value 9.3147261197964e-52

In [78]:
if p2 < 0.05:
    print("Business Conclusion:\n\tH0 rejected\n\t Hapiness status and Income status are associated") 
    
else:
     print("Business Conclusion:\n\tH0 NOT rejected\n\tHappyness status and Income status are associated")

Business Conclusion:
	H0 rejected
	 Hapiness status and Income status are associated